[
    {
        "id": "1",
        "title": "Odin",
        "date": "11\/04\/1982",
        "description": "Odin, All-father, was the king of the Norse gods. As the god of battle he had it in his power to cause wars and to decide who should win. He lived in Asgard, the highest of the nine worlds of Norse cosmology. From his throne he could survey everything in the worlds below. The ravens Huginn (thought) and Muninn (memory) helped him by flying far and wide. When they returned they sat on his shoulders and reported what they had seen.\r\n\r\nThe nine worlds were held together by the roots of the Tree of Life (Yggdrasil) which grew from the deepest depths up to the stars. Animals lived in this tree – deer and goats lived on its foliage and Ratatoskr, the squirrel, ran up and down the trunk spreading malicious gossip between the hawk and the eagle (who lived in the highest branches) and the mighty serpent (who lived among its deepest roots). This distracted the serpent from gnawing the roots in order to destroy the tree.\r\n\r\nOdin was also the god of poetry and wisdom, and his chief aim in life was the pursuit of knowledge.\r\n\r\nThe old Norse word rune means secret, and runes were believed by Vikings to be sacred secrets and a means of interacting with the living and the spiritual world. The runes lay in the Well of Urd, at the base of Yggdrasil. Since they do not reveal themselves to any but those who prove themselves worthy of such fearful insights, Odin hung himself from a branch of the tree, pierced himself with his spear and peered into the shadowy waters below. He forbade any of the other gods to grant him the slightest help, not even a sip of water. He stared downward and called to the runes.\r\n\r\nHe survived in this state, teetering on the precipice that separates the living from the dead, for nine days and nights. At the end of the ninth night, he finally saw shapes in the depths: the runes. They had accepted his sacrifice and shown themselves to him, revealing to him not only their forms but also the secrets that lie within them. Having fixed this knowledge in his memory, Odin ended his ordeal with a scream of exultation.\r\n\r\nEquipped with his knowledge of how to use the runes, he became one of the mightiest and most accomplished beings in the cosmos. He learned nine magic songs and eighteen highly powerful charms that enabled him to heal emotional and bodily wounds, to bind his enemies and render their weapons worthless, to free himself from constraints, to put out fires, to expose and banish practitioners of malevolent magic, to protect his friends in battle, to wake the dead, to win and keep a lover, and to perform many other feats.\r\n\r\nOdin’s ordeal was a sacrifice of himself to himself and is the ultimate sacrifice – for what could be a nobler offering to the god than the god himself? Part of Odin survived in order to be the recipient of the sacrifice – in addition to the runes themselves – and another part of him did indeed die.\r\n\r\nPerhaps the strength of character of many Viking warriors was largely due to the example set by him, with the songs sung in his honour telling of how he wasn’t afraid to sacrifice what we might call his ‘lower self’ to his ‘higher self’, to live according to his highest will unconditionally, accepting whatever hardships arise from that pursuit, and allowing nothing, not even death, to stand between him and the attainment of his goals."
    },
    {
        "id": "2",
        "title": "Thor",
        "date": "12\/02\/1988",
        "description": "Thor, the brawny thunder god, is the archetype of a loyal and honorable warrior, the ideal toward which the average human warrior aspired. He’s the indefatigable defender of the Aesir gods and their fortress, Asgard, from the encroachments of the giants, who are usually (although far from invariably) the enemies of the gods.\r\n\r\nNo one is better suited for this task than Thor. His courage and sense of duty are unshakeable, and his physical strength is virtually unmatched. He even owns an unnamed belt of strength (Old Norse megingjarðar) that makes his power doubly formidable when he wears the belt. His most famous possession, however, is his hammer, Mjöllnir (“Lightning”[2]). Only rarely does he go anywhere without it. For the heathen Scandinavians, just as thunder was the embodiment of Thor, lightning was the embodiment of his hammer slaying giants as he rode across the sky in his goat-drawn chariot. (Of course, they didn’t believe he physically rode in a chariot drawn by goats – like everything else in Germanic mythology, this is a symbol used to express an invisible reality upon which the material world is perceived to be patterned.)\r\n\r\nThor’s particular enemy is Jormungand, the enormous sea serpent who encircles Midgard, the world of human civilization. In one myth, he tries to pull Jormungand out of the ocean while on a fishing trip, and is stopped only when his giant companion cuts the fishing line out of fear. Thor and Jormungand finally face each other during Ragnarok, however, when the two put an end to each other.\r\n\r\nGiven his ever-vigilant protection of the ordered cosmos of pre-Christian northern Europe against the forces of chaos, destruction, and entropy represented by the giants, it’s somewhat ironic that Thor is himself three-quarters giant. His father, Odin, is half-giant, and his mother, variously named as Jord (Old Norse “Earth”), Hlöðyn, or Fjörgyn, is entirely of giant ancestry. However, such a lineage is very common amongst the gods, and shows how the relationship between the gods and the giants, as tense and full of strife as it is, can’t be reduced to just enmity."
    },
    {
        "id": "3",
        "title": "Loki",
        "date": "24\/02\/20012",
        "description": "While treated as a nominal member of the gods, Loki occupies a highly ambivalent and ultimately unique position among the gods, giants, and the other kinds of spiritual beings that populate the pre-Christian Norse religion.\r\n\r\nHis familial relations attest to this. His father is the giant Farbauti (Old Norse Fárbauti, “Cruel Striker”[1]). His mother is Laufey (the meaning of which is unknown) or Nal (Nál, “Needle”[2]). Laufey/Nal could be a goddess, a giantess, or something else entirely – the surviving sources are silent on this point. Loki is the father, by the giantess Angrboda (Angrboða, “Anguish-Boding”), of Hel, the goddess of the underworld; Jormungand, the great serpent who slays Thor during Ragnarok; and Fenrir, the wolf who bites off one of the hands of Tyr and who kills Odin during Ragnarok – hardly a reputable brood, to say the least. As we’ll see below, Loki demonstrates a complete lack of concern for the well-being of his fellow gods, a trait which could be discerned, in vague outline, merely by considering these offspring of his.\r\n\r\nWith his proper wife Sigyn (“Friend of Victory”[3]), he also has a son named Nari or Narfi, whose name might mean “Corpse.”[4]\r\n\r\nLoki often runs afoul not only of societal expectations, but also of what we might call “the laws of nature.” In addition to the progeny listed above, Loki is also the mother – yes, the mother – of Sleipnir, Odin’s shamanic horse, whom Loki gave birth to after shapeshifting into a mare and courting the stallion Svadilfari, as is recounted in the tale of The Fortification of Asgard.\r\n\r\nIn the tales, Loki is portrayed as a scheming coward who cares only for shallow pleasures and self-preservation. He’s by turns playful, malicious, and helpful, but he’s always irreverent and nihilistic."
    },
    {
        "id": "4",
        "title": "Frigg",
        "date": "18\/05\/2018",
        "description": "Strangely for a goddess of her high position, the surviving primary sources on Norse mythology give only sparse and casual accounts of anything related to her personality, deeds, or other attributes. The specifics they do discuss, however, are not unique to Frigg, but are instead shared by both her and Freya, a goddess who belongs to both the Aesir and the Vanir tribes of deities. From these similarities, combined with the two goddesses’ mutual evolution from the earlier Germanic goddess Frija, we can see that Frigg and Freya were only nominally distinct figures by the late Viking Age, when our sources were recorded, and that these two figures, who had formerly been the same deity, were still practically the same personage in everything but name."
    }
]