[
    {
        "id": "1",
        "title": "Baldur",
        "date": "01\/04\/2022",
        "description": "He’s loved by all the gods, goddesses, and beings of a more physical nature. So handsome, gracious, and cheerful is he that he actually gives off light.[1]\r\n\r\nThe meaning and etymology of his name are uncertain and have been the topic of intense scholarly debate. Numerous possibilities have been proposed, including a derivation from the Proto-Indo-European root *bhel- (“white”), Old Norse bál, “fire,” or a hypothesized word for “lord” common to various Germanic languages. The most straightforward – and probably correct – explanation, however, is that his name comes from the Old Norse word baldr, “bold.”[2][3] Scholars have been reluctant to accept this explanation due to its implication of a warlike character for Baldur. But as we’ll see below, Baldur may not have been as innocent and passive as he’s portrayed to be in the late Old Norse literary source that provides the most extensive description of the god and the tales in which he features.\r\n\r\nThis literary source is the Prose Edda of the medieval Icelandic scholar Snorri Sturluson. From this treatise on mythology and poetics comes the most complete account we have of the primary tale concerning Baldur, the story of his death and resurrection. This tale can be briefly summarized as follows:\r\n\r\nWhen Baldur began to have dreams of his death, Frigg went around to everything in the world and secured from each of them an oath to not harm her son. Confident in Baldur’s invincibility, the gods amused themselves by throwing weapons and any random thing they could find at Baldur and watching them bounce off of him, leaving him utterly unscathed.\r\n\r\nLoki, the guileful trickster of the gods, sensed an opportunity for mischief. He inquired of Frigg whether she had overlooked anything whatsoever in her quest to obtain oaths. She casually answered that she had thought the mistletoe to be too small and harmless a thing to bother asking for such a promise. Loki straightaway made a spear from the mistletoe and convinced the blind god Hodr to throw it at Baldur. The projectile pierced the god, and he fell down dead.\r\n\r\nThe anguished gods then ordained that one of them should go to the underworld to see if there was any way Baldur could be retrieved from the clutches of the death goddess, Hel. Hermod, another one of Odin’s many sons, agreed to make this journey, and, mounting Odin’s steed, Sleipnir, he rode down the world-tree until he came to its dark and damp roots, wherein lies Hel’s abode. When he arrived, he found his brother, pale and grim, sitting in the seat of honor next to Hel. Hermod implored the dreadful goddess to release Baldur, and after much persuasion, she replied that she would give him up if and only if everything in the world would weep for Baldur – to prove, in other words, that he was as universally beloved as Hermod claimed.\r\n\r\nThe whole world did indeed weep for the generous son of Odin – all, that is, save one creature. The giantess Þökk (“Thanks”[4]), generally assumed to be Loki in disguise, callously refused to perform the act that would secure Baldur’s return. And so Baldur was doomed to remain with Hel in her joyless realm."
    },
    {
        "id": "2",
        "title": "Heimdall",
        "date": "11\/11\/2011",
        "description": "Heimdall (pronounced “HAME-doll;” Old Norse Heimdallr, whose meaning/etymology is unknown) is one of the Aesir gods and the ever-vigilant guardian of the gods’ stronghold, Asgard.\r\n\r\nHis dwelling is called Himinbjörg (“Sky Cliffs,” connoting a high place ideal for a fortress), which sits at the top of Bifrost, the rainbow bridge that leads to Asgard. He requires less sleep than a bird. His eyesight is so keen that he can see for hundreds of miles by day or by night, and his hearing is so acute that he can hear grass growing on the ground and wool growing on sheep. Here he watches and listens, holding at the ready the horn Gjallarhorn (“Resounding Horn”), which he sounds when intruders are approaching.\r\n\r\nDuring Ragnarok, the gods will know that their doom is at hand when they hear the dire call of Gjallarhorn signaling the imminent arrival of the giants, who will cross the rainbow bridge to storm Asgard and kill the gods. The disloyal Loki, the particular nemesis of the unwaveringly dutiful Heimdall, will be with them. Loki and Heimdall will slay each other as the world burns and sinks into the sea."
    },
    {
        "id": "3",
        "title": "Tyr",
        "date": "31\/12\/2000",
        "description": "Tyr’s role as one of the principal war gods of the Norse, along with Odin and Thor, is well-attested in sources from the Viking Age and earlier. For example, in the Sigrdrífumál, one of the poems in the Poetic Edda, the valkyrie Sigrdrifa instructs the human hero Sigurd to invoke Tyr for victory in battle. Another Eddic poem, the Lokasenna, corroborates this picture by having Loki insult Tyr by saying that he could only stir people to strife, and could never reconcile them.\r\n\r\nSome centuries earlier, the Romans identified Tyr with Mars, their own principal war god. This connection survives in the modern English “Tuesday,” from Old English “Day of Tiw (Tyr)” (Tiwesdæg), which was in turn based on the Latin Dies Martis, “Day of Mars.” (The Romans’ identification of Tyr with Mars also reinforces the point that he was quite a significant god; otherwise they surely wouldn’t have identified him with one of their own major gods.)\r\n\r\nBut Tyr is far from only a war god. In fact, his primary role seems to be that of an upholder of law and justice. Those Roman inscriptions to him as “Mars,” for example, sometimes invoke him as Mars Thincsus – that is, Mars of the Þing, the ancient Germanic legal assembly.\r\n\r\nBut the most compelling evidence for Tyr’s role as divine jurist – and a heroic one at that – comes from the tale of The Binding of Fenrir, the only surviving myth to feature Tyr prominently. The dreadful wolf Fenrir was only a pup, but he was growing quickly. The gods feared for their lives, so they endeavored to tie up Fenrir in fetters from which he couldn’t escape. When Fenrir laid eyes on the chain that would eventually bind him, he was suspicious, and declared that he would only allow the gods to put it around him if one of them would stick an arm in his mouth as a pledge of good faith. Only Tyr was willing to do so. When the wolf found himself unable to break free, he bit off Tyr’s arm.\r\n\r\nIn the words of the esteemed scholar of comparative religion Georges Dumézil, Tyr, “with his sacrifice… not only procures the salvation of the gods but also regularizes it: he renders legal that which, without him, would have been pure fraud.” In the same way that Odin showed himself to be the foremost god of wisdom by sacrificing one of his eyes in its pursuit, so Tyr showed himself to be the foremost god of law by sacrificing one of his arms to uphold it. The disfigurements of both gods are parallel, and demonstrate something essential about their characters"
    },
    {
        "id": "4",
        "title": "Idun",
        "date": "01\/01\/2001",
        "description": "Idun (pronounced “IH-dune;” from Old Norse Iðunn, “The Rejuvenating One”[1]) is a goddess who belongs to the Aesir tribe of deities. Her role in the pre-Christian mythology and religion of the Norse and other Germanic peoples is unfortunately obscure, but she features prominently in one of the best-known mythological tales, The Kidnapping of Idun. In this tale, which comes to us from the skaldic poem Haustlöng and the Prose Edda, Idun is depicted as the owner and dispenser of a fruit that imparts immortality.\r\n\r\nIn modern books on Norse mythology, these fruits are almost invariably considered to be apples, but this wasn’t necessarily the case in heathen times. The Old Norse word for “apple,” epli, was often used to denote any fruit or nut, and “apples” in the modern English sense didn’t arrive in Scandinavia until late in the Middle Ages.[2] Whatever species Idun’s produce belongs to, its ability to sustain the immortality of the gods and goddesses makes Idun an indispensable presence in Asgard.\r\n\r\nIdun is the wife of Asgard’s court poet and minstrel, Bragi. One Old Norse poem has Loki accuse her of sleeping with her brother’s murderer,[3] but the identities of her brother and his slayer are unknown, and no tale explaining this accusation has survived into the modern era.\r\n\r\nUnfortunately, that’s about all we know about Idun, due to the sparseness of mentions of her in the sources of our present-day knowledge of Norse mythology and religion."
    },
    {
        "id": "5",
        "title": "Bragi",
        "date": "02\/02\/2002",
        "description": "Bragi (pronounced “BRAG-ee;” Old Norse Bragi, “Poet”) is the wise and learned bard (Old Norse þulr, pronounced “THOOL-ur”) of Valhalla, the magnificent hall of the god Odin. Old Norse poetry from the Viking Age frequently features him regaling the einherjar, the dead who dwell in Valhalla, and welcoming recently deceased heroes into their midst.[1] One Eddic poem depicts him as having runes carved on his tongue.[2]\r\n\r\nBragi was originally the historical ninth-century bard Bragi Boddason. His poems were so outstandingly artful and moving that subsequent generations imagined that, upon his death, Odin had appointed him the court poet of Valhalla. After all, a troop of elite warriors, kings, and others favored by Odin needed an elite bard to sing of their countless exploits.[3]\r\n\r\nThe Old Norse writers of the Christian Middle Ages took this a step further and portrayed Bragi as having been nothing less than a god of poetry. One such author even claimed that one of the Old Norse words for “poetry,” bragr, was derived from Bragi’s name.[4] He was said to be the husband of the goddess Idun, whose fruits guarantee the continued immortality of the gods.\r\n\r\nHowever, this seems to have been a misunderstanding on the part of such late authors, and there’s no evidence that Bragi was ever actually worshiped as a god while the pre-Christian Norse religion was still a living tradition."
    },
    {
        "id": "6",
        "title": "Vili and Ve",
        "date": "01\/01\/-1800",
        "description": "Vili and Ve (pronounced “VILL-ee” and “VAY,” respectively) are the two brothers of the god Odin, with whom they shared a decisive role in the creation of the cosmos.\r\n\r\nThe medieval Icelandic scholar Snorri Sturluson tells us that Odin, Vili, and Ve were the first true Aesir gods to exist. Their parents were the proto-god Borr and the giantess Bestla. The three brothers slew the giant Ymir, the first being who had come into existence, and fashioned the cosmos from his corpse.[1] While Snorri is not generally a particularly reliable source, there are good reasons to accept this particular information as an authentic account of pre-Christian Norse views, given how well it accords with other evidence that we’ll consider below.\r\n\r\nVili and Ve also feature in one other tale that has come down to us: when Odin was temporarily exiled from Asgard, the Aesir deities’ celestial stronghold, for practicing “unmanly” magic, Vili and Ve slept with his wife, Frigg.[2][3] Unfortunately, no more is known about their role in this series of events.\r\n\r\nOther explicit references to Vili and Ve in Old Norse literature are limited to passing mentions of Vili as the brother of Odin.[4] The characters Hárr (“High”), Jafnhárr (“Just as High”), and Þriði (“Third”) in Snorri’s Prose Edda, whose roles in the nominal narrative are purely didactic, could be Odin, Vili, and Ve,[5] but it’s just as likely that they’re Odin under three different forms, since all three names are applied to Odin elsewhere in Old Norse poetry.[6]\r\n\r\nThe most compelling information about Vili and Ve may be found in their names. In Old Norse, Vili means “Will,”[7] and Vé means “Temple”[8] and is etymologically closely related to other words that have to do with the sacred, and hallowing in particular.\r\n\r\nIntriguingly, the Proto-Germanic names of Odin, Vili, and Ve would have been, respectively, *Woðanaz, *Weljon,[9] and *Wixan.[10] This alliteration can hardly be coincidental, and suggests that the triad dates back to the time when the Proto-Germanic language was spoken – well before the Viking Age began in approximately 800 AD, and quite possibly no less than a millennium or two prior to that date.[11]\r\n\r\nAlthough they are only mentioned sporadically in literature from the Viking Age and shortly thereafter, Vili and Ve must have been deities of prime importance to the Norse and other Germanic peoples, at least during the time of the Germanic tribes, and possibly later as well. No mythological figure of only minor importance would have been retained throughout such a large proportion of the thousands of years the Germanic myths were in active use, during which they underwent numerous significant changes. The fact that Vili and Ve are cast as the brothers of Odin, perhaps the highest Germanic god throughout much of this time, is a further suggestion of their lofty stature.\r\n\r\nIndeed, Odin, Vili, and Ve – respectively, Inspiration, Conscious Intention, and the Sacred – are the three most basic forces or characteristics that distinguish any cosmos from chaos. Hence it was these three gods who originally fashioned the cosmos, and surely remained three of the most necessary pillars of its continued upkeep and prosperity."
    }
]