[
    {
        "id": "11",
        "title": "Freyr",
        "date": "always",
        "description": "Freyr (pronounced “FREY-ur;” Old Norse Freyr, “Lord;” sometimes anglicized as “Frey”) is a god who belongs to the Vanir tribe of deities. He’s also an honorary member of the other tribe of Norse gods, the Aesir, having arrived in their fortress, Asgard, as a hostage at the closing of the Aesir-Vanir War.\r\n\r\nFreyr was one of the most widely and passionately venerated divinities amongst the heathen Norse and other Germanic peoples. One Old Norse poem calls him “the foremost of the gods” and “hated by none.”[1] The reasons for this aren’t hard to understand; their well-being and prosperity depended on his benevolence, which particularly manifested itself in sexual and ecological fertility, bountiful harvests, wealth, and peace. His role in providing health and abundance was often symbolized by his fylgja, the boar Gullinborsti (“Golden-Bristled”),[2] and by his enormous, erect phallus.[3]\r\n\r\nIt shouldn’t be surprising, then, that Freyr was a frequent recipient of sacrifices at various occasions, such as the blessing of a wedding[4] or the celebration of a harvest. During harvest festivals, the sacrifice traditionally took the form of his favored animal, the boar.[5]\r\n\r\nHis father is Njord, and his mother is Njord’s unnamed sister[6] (presumably Nerthus). Freyr himself has been the lover of numerous goddesses and giantesses, including his own sister, Freya.[7] Apparently incest is a common and acceptable practice among the Vanir (although amongst the historical Germanic peoples it certainly wasn’t).\r\n\r\nFreyr’s residence is Alfheim, the homeland of the elves.[8] This could mean that Freyr is the ruler of the elves, but since this is never stated explicitly in the surviving sources, it must remain a fascinating conjecture. The relationship between the gods and the elves is sufficiently ambiguous to allow for a number of possible connections between Freyr and the elves.\r\n\r\nAnother one of Freyr’s signature possessions is his ship, Skíðblaðnir, which always has a favorable wind and can be folded up and carried in a small bag.[9] Its name, which means “Assembled from Pieces of Thin Wood,” suggests that it served as the mythological archetype of ships that were constructed for particular ritual purposes and were never meant to be seaworthy. We know from archaeological evidence that ships played a major role in the pre-Christian religious rites of the Germanic peoples,[10] which is perfectly in accordance with the major role played by ships in the Bronze and Iron Ages, particularly among the Scandinavians.\r\n\r\nOn land, Freyr travels in a chariot drawn by boars.[11] This is another mythological feature that was reflected in historical ritual. We know from medieval Icelandic sources that priestesses and/or priests of Freyr traveled throughout the country on a chariot which contained a statue of the god.[12] The significance of such processions is described by the Roman historian Tacitus, who vividly depicts the processions connected with the early Germanic goddess Nerthus, whose name is the Proto-Germanic form of the name of Freyr’s father Njord. When the chariot reached a village or town, the people laid down their arms and “every iron object” and enjoyed a period of peace and joyful festivities, reveling in the deity’s kind presence.[13] Such processions and celebrations appear to have been a common feature of the worship of the deities the Norse called the Vanir from at least as far back as the first century CE through the Viking Age.\r\n\r\nDuring Ragnarok, Freyr and the giant Surt are fated to destroy each other."
    },
    {
        "id": "12",
        "title": "Fenrir",
        "date": "yesterday",
        "description": "Fenrir (pronounced “FEN-rir;” Old Norse Fenrir, “He Who Dwells in the Marshes”[1]) is the most infamous of the many wolves in Norse mythology. His importance for the pre-Christian Scandinavians is demonstrated by his being depicted on numerous surviving runestones, not to mention his ubiquity in Old Norse literary sources.\r\n\r\nHe’s the son of the god Loki and the giantess Angrboda, which makes him the brother of the serpent Jormungand and the underworld goddess Hel.\r\n\r\nAs is recounted more fully in the tale The Binding of Fenrir, the Aesir gods raised Fenrir themselves in order to keep him under their control and prevent him from wreaking havoc throughout the Nine Worlds. He grew at an astonishingly fast pace, however, and eventually the troubled gods decided to chain him up. Their first two attempts were unsuccessful; while the cunning gods convinced Fenrir that it was only a game, a test of his strength, he broke through the fetters easily. For their third attempt, the gods had the dwarves forge the strongest chain ever built, which nevertheless gave the appearance of being very light and even soft to the touch. When the gods presented Fenrir with this third fetter, he became suspicious, and he refused to be bound with it unless one of the gods would stick his or her hand in his mouth as a pledge of good faith. Only Tyr was brave enough to do this, knowing that it would mean the loss of his hand. And, sure enough, when Fenrir found himself unable to break free of his bonds, he ripped Tyr’s hand from its arm. The chain was then tied to a boulder and a sword was placed in Fenrir’s jaws to hold them open. As he howled wildly and ceaselessly, a foamy river called “Expectation” (Old Norse Ván) flowed from his drooling mouth.[2]\r\n\r\nAs the river’s ominous name implies, this was not the end of Fenrir. At Ragnarok, he will break free and run throughout the world with his lower jaw against the ground and his upper jaw in the sky, devouring everything in his path.[3] He will even kill the god Odin before finally being put to death by one of Odin’s avenging sons.\r\n\r\nFenrir and Other Wolves in Norse Mythology\r\n\r\nThere’s good reason to think that many of the other wolves mentioned in Old Norse literature are actually Fenrir going under different names. One Old Norse poem states that he will swallow the sun during Ragnarok,[4] a feat which is elsewhere reserved for another wolf named Skoll (“Mockery”). Another Old Norse poem repeatedly mentions a wolf named Garm who will break free from chains at Ragnarok; this is quite possibly Fenrir going under a different name.[5] In another source, we find the wolf who will consume the moon called by the name of “Moon-garm” (Mánagarmr).[6] Thus, the moon-eating wolf, who is elsewhere called Hati (“Hatred”) could be another extension of Fenrir – or at least of Garm, if Garm is not himself an extension of Fenrir.\r\n\r\nPerhaps the Vikings thought that it is ultimately Fenrir who, in addition to killing Odin and destroying much of the world, will eat the sun and the moon during Ragnarok. But these wolves are never precisely delineated in the primary sources, so we’re left to guess as to what exactly the relationship between them is."
    },
    {
        "id": "13",
        "title": "Jormungand",
        "date": "today",
        "description": "Jormungand (pronounced “YOUR-mun-gand;” Old Norse Jörmungandr, “Great Beast”), also called the “Midgard Serpent,” is a snake or dragon who lives in the ocean that surrounds Midgard, the visible world. So enormous is he that his body forms a circle around the entirety of Midgard. He’s one of the three children of Loki and the giantess Angrboda, along with Hel and Fenrir.\r\n\r\nThe god Thor is his particular enemy. Two battles between them are recounted in the Eddas. In one, Thor fishes for Jormungand, and fails to pull him up only when the giant Hymir, terrified that this will bring about Ragnarok, severs the line, sending the snake back down to the depths. When Ragnarok does arrive, however, Thor and the Midgard Serpent are fated to slay each other.\r\n\r\nJormungand likely already featured in the religion of the original Germanic tribes, as evidenced by his existence in the later pre-Christian religions of different branches of the Germanic peoples. For example, continental Germans attributed earthquakes to his movements well into the Middle Ages."
    },
    {
        "id": "14",
        "title": "Hel",
        "date": "tomorrow",
        "description": "Hel (Old Norse Hel, “Hidden”[1]) is a giantess and/or goddess who rules over the identically-named Hel, the underworld where many of the dead dwell. Her name’s meaning of “Hidden” surely has to do with the underworld and the dead being “hidden” or buried beneath the ground.\r\n\r\nAccording to the thirteenth-century Icelandic scholar Snorri Sturluson, Hel is the daughter of Loki and the giantess Angrboda (Old Norse Angrboða, “Anguish-boding”), and therefore the sister of the wolf Fenrir and the world serpent, Jormungand.[2] This makes her part of a highly dangerous and disreputable family.\r\n\r\nHel is generally presented as being rather greedy, harsh, and cruel, or at least indifferent to the concerns of both the living and the dead. However, her personality is little-developed in what survives of Old Norse literature. She’s mostly mentioned only in passing. Snorri describes her appearance as being half-black, half-white, and with a perpetually grim and fierce expression on her face.[3]\r\n\r\nThe only surviving myth in which she features prominently is that of The Death of Baldur. The beloved god Baldur was slain by none other than Hel’s father, Loki, and the gods sent an emissary named Hermod to Hel in hopes of retrieving Baldur. Hermod pleaded with Hel, telling her how every living thing was in sorrow over the loss of Baldur. But Hel wouldn’t give up her prize so easily. She told Hermod – in a taunting way, we can imagine – that she would only consent to release Baldur if every last thing in the universe wept for him. Hermod and the other gods went around and got almost everything in the cosmos to weep for Baldur. Only one giantess, who was probably Loki in disguise, refused. But because of that one refusal, the terms of Hel’s offer weren’t met, and Hel kept Baldur in her cold clutches.\r\n\r\nBecause of how sparsely-defined her character is, many scholars view Hel as more of a late literary personification of the grave than a goddess who was actually worshiped or appeased in her own right.[4] Due to the lack of conclusive evidence either way, this must remain an open question."
    },
    {
        "id": "15",
        "title": "Ymir",
        "date": "last week",
        "description": "Ymir (pronounced roughly “EE-mir;” Old Norse Ymir, “Screamer”[1]) is a hermaphroditic giant and the first creature to come into being in the Norse creation myth. As the first giant, he’s the ancestor of all of the other giants – and, since almost all of the gods are partially descended from giants, he’s their ancestor as well. Another name for Ymir in some Old Norse poems is Aurgelmir (“Sand/Gravel Screamer”).[2]\r\n\r\nAccording to the medieval Icelandic scholar Snorri Sturluson, Ymir was born when fire from Muspelheim and ice from Niflheim met in the abyss of Ginnungagap. Ymir was suckled by the cow Audhumla for his nourishment. When he slept, several other giants were conceived asexually in Ymir’s hermaphroditic body, and spontaneously sprang from his legs and the sweat from his armpits.\r\n\r\nAudhumla received her nourishment from a salt lick, and as she licked, a being named Buri, the first of the Aesir gods, was freed from within the salt. He produced a son, Borr, who mated with Bestla, one of Ymir’s descendants. From their union came Odin, the chief of the Aesir, and his two brothers, Vili and Ve.\r\n\r\nThe divine brothers then slew Ymir and fashioned the cosmos from his corpse. As one of the poems in the Poetic Edda, Grímnismál or “Song of the Hooded One,” words it:\r\n\r\nFrom Ymir’s flesh the earth was created,\r\nAnd from his sweat [or, in some versions, blood] the sea,\r\nMountains from bone,\r\nTrees from hair,\r\nAnd from his skull the sky.\r\n\r\nAnd from his eyebrows the blithe gods made\r\nMidgard, home of the sons of men\r\nAnd from his brains\r\nThey sculpted the grim clouds."
    }
]