[
    {
        "id": "16",
        "title": "Yggdrasil",
        "date": "Forever",
        "description": "Yggdrasil (Old Norse Yggdrasill or Askr Yggdrasils) is the mighty tree whose trunk rises at the geographical center of the Norse spiritual cosmos. The rest of that cosmos, including the Nine Worlds, is arrayed around it and held together by its branches and roots, which connect the various parts of the cosmos to one another. Because of this, the well-being of the cosmos depends on the well-being of Yggdrasil. When the tree trembles, it signals the arrival of Ragnarok, the destruction of the universe.[1]\r\n\r\nThe first element in Yggdrasil’s name, Yggr (“Terrible”), is one of the countless names of the god Odin, and indicates how powerful and fearsome the Vikings perceived him to be. The second element, drasill, means “horse.” So Yggdrasil’s name means “Horse of Odin,” a reference to the time when the Terrible One sacrificed himself to discover the runes. The tree was his gallows and bore his limp body, which the Norse poetic imagination described metaphorically as a horse and a rider.[2]\r\n\r\nIn Old Norse literature, Yggdrasil is commonly said to be an ash tree,[3] but at other times, it’s said that no one knows the species to which the magnificent tree belongs.[4] As with so many aspects of Norse mythology and religion, there doesn’t seem to have been any airtight consensus on this during the Viking Age.\r\n\r\nIn the words of the Old Norse poem Völuspá, Yggdrasil is “the friend of the clear sky,”[5] so tall that its crown is above the clouds. Its heights are snow-capped like the tallest mountains, and “the dews that fall in the dales” slide off of its leaves.[6] Hávamál adds that the tree is “windy,” surrounded by frequent, fierce winds at its heights. “No one knows where its roots run,”[7] because they stretch all the way down to the underworld, which no one (except shamans) can see before he or she dies. The gods hold their daily council at the tree.[8]\r\n\r\nNumerous animals are said to live among Yggdrasil’s stout branches and roots. Around its base lurk the dragon Nidhogg and several snakes, who gnaw at its roots. An unnamed eagle perches in its upper branches, and a squirrel, Ratatoskr (“Drill-Tooth”[9]), scurries up and down the trunk conveying the dragon’s insults to the eagle and vice versa. Meanwhile, four stags – Dainn, Dvalinn, Duneyrr, and Durathror – graze on the tree’s leaves.[10]\r\n\r\nAmusing though some of these animals and their activities may be, they hold a deeper significance: the image of the tree being nibbled away little by little by several beasts expresses its mortality, and along with it, the mortality of the cosmos that depends on it.[11]\r\n\r\nThe Old Norse sources provide vivid but contradictory accounts of the number and arrangement of the roots and wells beneath the base of Yggdrasil’s trunk.\r\n\r\nAccording to the poem Grímnismál, Yggdrasil has three main roots: one planted in Midgard, the world of mankind; one in Jotunheim, the world of the giants; and one in Hel, the underworld.[12] Völuspá mentions only one well beneath the tree: the Well of Urd (Urðarbrunnr, “Well of Fate“).[13]\r\n\r\nHowever, Snorri Sturluson, in his Prose Edda, holds that there are actually three wells beneath the tree, one for each of its roots. The Well of Urd, according to him, is not below Yggdrasil, as it is in Völuspá – it’s actually in the sky, and the root that grows out of it bends upward into the sky (!). The Well of Urd is where the gods hold their daily council meetings. The second well is called Hvergelmir (perhaps “Bubbling Cauldron”[14] or “Roaring Kettle”[15]), and it’s the body of water beneath the second root, which stretches into Niflheim, the world of primal ice. This is the root that Nidhogg chews. The third well is that of the wise being Mimir, and it and its root lie in the realm of the giants.[16]\r\n\r\nHere as elsewhere, Snorri is probably introducing an artificial systematization of his own invention that didn’t exist in the Viking Age (Snorri wrote centuries thereafter). However, some of the elements he includes may have been drawn from legitimate sources that are now lost to us. For instance, Yggdrasil was sometimes called Mímameiðr, “Post of Mimir,”[17] which demonstrates that there was some particular connection between Mimir and the tree – and surely also the well that’s frequently mentioned in connection with Mimir.\r\n\r\nBut what about the Nine Worlds themselves? How are they arranged around Yggdrasil? The Old Norse sources never tell us – and, for that matter, they never tell us which worlds comprise the Nine in the first place. Given the lack of systematization or codification that characterizes all of Norse mythology and religion, and the tolerance for fluidity, ambiguity, and even contradiction that it implies, it’s doubtful that there was ever a “map” or diagrammatic image of the Nine Worlds and their arrangement in which all of the pagan Norse believed. (All – all – of the pictures you’ll find online are at best speculative and unverifiable.)\r\n\r\nNevertheless, there are some clues in the sources that might enable us to construct a tentative and partial schema of where some of the Nine Worlds would have been generally thought to be located. They seem to have been arranged along two axes, one vertical, the other horizontal. The vertical axis would correspond to Yggdrasil’s trunk, with Asgard in the highest branches, Midgard on the ground at the tree’s base, and Hel underground amongst the tree’s roots. The horizontal axis would be based on the distinction the Vikings made between the innangard and utangard. Thus, Asgard would be right over the trunk of the tree, Midgard around the trunk (and therefore in the “middle” on both of these axes), and Jotunheim would surround Midgard and thereby be that much more distant from the trunk. As for the other worlds: who knows?\r\n\r\nIn any case, we can see how vital to the Norse worldview Yggdrasil was felt to be by the number of earthly trees the Vikings treated as representations of the great world-tree. Adam of Bremen describes a particularly majestic one near the Temple of Uppsala in Sweden. Farmsteads were customarily designed around such a tree, making the farmstead a miniature reproduction of the sacred spiritual cosmos."
    },
    {
        "id": "17",
        "title": "Valhalla",
        "date": "Forever",
        "description": "Valhalla (pronounced “val-HALL-uh”; Old Norse Valhöll, “the hall of the fallen”[1]) is the hall where the god Odin houses the dead whom he deems worthy of dwelling with him.\r\n\r\nAccording to the Old Norse poem Grímnismál (“The Song of the Hooded One”), the roof of the “gold-bright” Valhalla is made of shields, and has spears for its rafters. Seats made of breastplates surround the many feasting tables of the vast hall. Its gates are guarded by wolves, and eagles fly above it.[2]\r\n\r\nThe dead who reside in Valhalla, the einherjar, live a life that would have been the envy of any Viking warrior. All day long, they fight one another, doing countless valorous deeds along the way. But every evening, all their wounds are healed, and they are restored to full health.[3] They surely work up quite an appetite from all those battles, and their dinners don’t disappoint. Their meat comes from the boar Saehrimnir (Old Norse Sæhrímnir, whose meaning is unknown[4]), who comes back to life every time he is slaughtered and butchered. For their drink they have mead that comes from the udder of the goat Heidrun (Old Norse Heiðrun, whose meaning is unknown[5]). They thereby enjoy an endless supply of their exceptionally fine food and drink.[6] They are waited on by the beautiful Valkyries.\r\n\r\nBut the einherjar won’t live this charmed life forever. Valhalla’s battle-honed residents are there by the will of Odin, who collects them for the perfectly selfish purpose of having them come to his aid in his fated struggle against the wolf Fenrir during Ragnarok – a battle in which Odin and the einherjar are doomed to die."
    },
    {
        "id": "18",
        "title": "Midgard",
        "date": "Forever",
        "description": "Midgard (Old Norse Miðgarðr, Gothic midjungards, Old English middangeard, Old Saxon middilgard, Old High German mittilgart or mittangard, Proto-Germanic *meðjanagarðaz,[1][2] “Middle Enclosure”) is one of the Nine Worlds of Norse mythology and an important concept in the pre-Christian worldview of all of the Germanic peoples. It’s the inhabited world, and roughly corresponds to the modern English word and concept of “civilization.” It’s the only one of the Nine Worlds that’s primarily located in the visible world; the others, while they may intersect with the visible world at various points, are first and foremost invisible locations.\r\n\r\nThe name “Midgard” (“Middle Enclosure”) has a double meaning. The first meaning of the word refers to civilization’s position “in the middle of” an otherwise wild world, which is reflected on the cosmological plane by Midgard’s being surrounded by the uninhabited wilderness of Jotunheim, the world of the often-hostile giants. This is akin to the way in which the continents are surrounded by the ocean, which is, in the ancient Germanic perspective, also teeming with giants. The serpent Jormungand lives in the sea and encircles the terrestrial Midgard and the wilderness at its borders, and Aegir and Ran dwell in the same watery depths and claim the lives of unfortunate seafarers. You might call this part of the word’s meaning “horizontal.” The second and “vertical” sense of the word’s meaning refers to Midgard’s position below Asgard, the world of the Aesir gods and goddesses, and above the underworld. This vertical axis is represented by the world-tree Yggdrasil, which holds Asgard in its upper branches, Midgard at the base of its trunk, and the underworld amongst its roots.\r\n\r\nBoth of these senses of the word’s meaning ultimately refer to Midgard’s place in the psychogeographical distinction between the innangard and utangard, one of the most important concepts in the ancient Germanic worldview. That which is innangard (“inside the fence”) is orderly, law-abiding, and civilized, while that which is utangard (“beyond the fence”) is chaotic, anarchic, and wild. This applies both to the geographical plane and the human psyche; thoughts and actions can be innangard or utangard just as readily as spatial locations. Asgard, the “Enclosure of the Aesir,” is the divine model of the innangard, while Jotunheim, the “Homeland of the Giants,” is the model of the utangard. Midgard is, once again, somewhere in the middle. But, as the -gard element in the name implies, Midgard is – at least in theory – striving to be more like Asgard, more ordered according to the divine model upon which it’s patterned.\r\n\r\nWhen the gods gave the world its initial shape, they slew the giant Ymir and created the various part of the world from his body parts. In order to protect Midgard and humanity from the giants, they built a fence around Midgard out of Ymir’s eyebrows. Building fences around farms repeated this paradigmatic act, marking off that which was within the fences as innangard and that which was outside the fences as utangard.\r\n\r\nDuring Ragnarok, the destruction of the cosmos, Midgard sinks into the sea along with everything else in the universe."
    },
    {
        "id": "19",
        "title": "Jotunheim",
        "date": "Forever",
        "description": "Jotunheim (pronounced “YO-tun-hame;” Old Norse Jötunheimr, “World of the Giants”) is one of the Nine Worlds, and, as the name implies, the homeland of the giants (Old Norse jötnar).\r\n\r\nJotunheim is also known as Utgard (pronounced “OOT-guard;” Old Norse Útgarðr, “Beyond the Fence”), a name which establishes the realm as occupying one extreme end of the traditional Germanic conceptual spectrum between the innangard and the utangard. That which is innangard (“inside the fence”) is orderly, law-abiding, and civilized, while that which is utangard (“beyond the fence”) is chaotic, anarchic, and wild. This psychogeography found its natural expression in agrarian land-use patterns, where the fence (the “gard” or garðr of the above terms) separated pastures and fields of crops from the wilderness beyond them. In fact, the very word “wilderness” comes from a Germanic language, Old English, where the word formed from the roots wild-deor-ness literally means “the place of self-willed beasts.”[1] One would therefore expect the cosmological Utgard/Jotunheim to be symbolized as a vast, mighty wilderness that surrounds a more civilized world.\r\n\r\nAnd, indeed, that is exactly the place Jotunheim occupies in the pre-Christian Germanic cosmology. At the center of this cosmology are Asgard, “The Enclosure of the Aesir Deities,” and its human counterpart, Midgard, “The Middle Enclosure.” Asgard is the divine model of the innangard. Midgard, the visible world and especially human civilization, is patterned upon the divine model. The “Middle” element in its name largely refers to its being surrounded by – in the middle of – Jotunheim.\r\n\r\nIn the Eddas, the dwelling-places of the giants are described as deep, dark forests, mountain peaks where winter never eases its grip, and similarly inhospitable and grim landscapes, and this certainly seems to be how the heathen Norse and other Germanic peoples symbolically visualized the invisible Jotunheim itself."
    },
    {
        "id": "20",
        "title": "Asgard",
        "date": "Forever",
        "description": "Asgard (Old Norse Ásgarðr, “Enclosure of the Aesir) is one of the Nine Worlds of Norse mythology and the home and fortress of the Aesir, one of the two tribes of gods (the other being the Vanir, who have their home in Vanaheim). Asgard is located in the sky[1] (albeit spiritually rather than physically, of course) and is connected to Midgard, the world of humanity, by the rainbow bridge Bifrost.\r\n\r\nThe -gard element in Asgard’s name is a reference to the ancient Germanic concept of the distinction between the innangard and utangard. That which is innangard (“inside the fence”) is orderly, law-abiding, and civilized, while that which is utangard (“beyond the fence”) is chaotic, anarchic, and wild. This applies both to the geographical plane and the human psyche; thoughts and actions can be innangard or utangard just as readily as spatial locations. Asgard is the ultimate model of the innangard, while Jotunheim, the “Homeland of the Giants,” is the epitome of the utangard.\r\n\r\nMidgard (“Middle Enclosure”), the world of human civilization, is, as the name implies, somewhere in the middle – not quite as innangard as Asgard and not quite as utangard as Jotunheim. But Midgard is a space enclosed, on the geographical plane, by fences, and on the psychological plane by norms and laws. This makes it much closer – at least in theory – to Asgard than to Jotunheim. In other words, Asgard is the divine model upon which the pre-Christian Norse people patterned their world."
    },
    {
        "id": "21",
        "title": "Vanaheim",
        "date": "Forever",
        "description": "Vanaheim (Old Norse Vanaheimr, “Homeland of the Vanir“) is one of the Nine Worlds that are situated around the world-tree Yggdrasil. As the name implies, it’s the home of the Vanir tribe of deities, who tend to be somewhat more associated with fertility and what we today would call “nature” than the other tribe of Norse deities, the Aesir, who have their home in Asgard.\r\n\r\nThe surviving sources for our information on Norse mythology and religion, as fragmentary as they are, don’t contain any explicit mention of where exactly Vanaheim is located.[1] The sole clue we have comes from the Lokasenna (“The Taunting of Loki“), one of the poems in the Poetic Edda, which states that the Vanir god Njord went eastward when he went to Asgard as a hostage at the conclusion of the Aesir-Vanir War.[2] Presumably, then, Vanaheim lies somewhere to the west of Asgard.\r\n\r\nSome scholars have gone so far as to claim that Vanaheim was invented by the thirteenth-century Icelandic Christian historian and poet Snorri Sturluson.[3] However, there is one authentic and reliable Old Norse poem that mentions Vanaheim by name,[4] so we can be reasonably certain that it was a genuine element of pre-Christian Norse religion.\r\n\r\nIt should come as no surprise, then, that the sources are completely silent as to what kind of world Vanaheim is. However, its name may contain an indication of the place’s character. One of the primary ways the pre-Christian Norse and other Germanic peoples classified geographical spaces (as well as psychological states) was with reference to their concept of the distinction between the innangard and utangard. That which is innangard (“inside the fence”) is orderly, law-abiding, and civilized, while that which is utangard (“beyond the fence”) is chaotic, anarchic, and wild. This psychogeography found its natural expression in agrarian land-use patterns, where the fence (the -gard or, in Old Norse, -garðr of the above terms) separated pastures and fields of crops from the wilderness beyond them. Of the Nine Worlds, two are innangard spaces: Asgard and Midgard, the world of human civilization. Both of these contain -gard in their names and are depicted as having a fence or fortification surrounding them. The rest of the Nine Worlds’ names end in -heim, and there’s no reference to their being enclosed in any way, which seems to indicate that they’re essentially utangard places. Such a designation is certainly in keeping with the way these places are described in Old Norse literature. Thus, we can infer that Vanaheim, like the Vanir themselves, is somewhat more wild or “natural,” and less “cultural,” than the world of the Vanir’s Aesir counterparts, or even that of humanity."
    },
    {
        "id": "22",
        "title": "Niflheim",
        "date": "Forever",
        "description": "Niflheim (pronounced “NIF-el-hame;” from Old Norse Niflheimr, “World of Fog”) is one of the Nine Worlds of Norse mythology and the homeland of primordial darkness, cold, mist, and ice. As such, it’s the opposite cosmological principle of Muspelheim, the world of fire and heat.\r\n\r\nIn the Norse creation narrative as related by the medieval Christian Icelandic historian Snorri Sturluson, the first being, the giant Ymir, was born when ice from Niflheim and fire from Muspelheim met in the middle of Ginnungagap, the abyss that had formerly separated them.\r\n\r\nThe word “Niflheim” is only found in the works of Snorri and is often used interchangeably with “Niflhel,” a poetic embellishment of “Hel,” the world of the dead. “Niflhel” is found in Old Norse poems that are much older than Snorri’s works. It’s entirely possible that the word “Niflheim” is an invention of Snorri’s.[1] It’s impossible to know whether the attendant concept is of similarly late and spurious origins, because our only source for anything that even pretends to be a full account of the heathen Norse creation narrative comes from – you guessed it – the works of Snorri."
    },
    {
        "id": "23",
        "title": "Muspelheim",
        "date": "Forever",
        "description": "Muspelheim (pronounced “MOO-spell-hame;” Old Norse Múspellsheimr, “The World of Múspell“) is one of the Nine Worlds and the home of the fire giants.\r\n\r\nThe word “Muspelheim” is recorded only in the Prose Edda of Snorri Sturluson, a late work that can’t be taken at face value as representing authentic pre-Christian Norse mythology. However, the basic cosmological principle it represents can be tracked far into the Germanic past. Cognates of Múspell can be found in Old High German and Old Saxon texts, meaning that the word and the concept it denotes likely go back to the Proto-Germanic period. Its oldest meaning, when one compares these various sources, seems to have been “end of the world through fire.”[1] In earlier Old Norse poetry, the word seems to refer to a giant who leads his “people” or “sons” into battle against the gods during Ragnarok.[2] Even if the idea of Muspelheim as a place rather than an event or a person is an invention of Snorri’s, it’s a relatively minor accretion, and one which is broadly consistent with the earlier uses of Múspell.\r\n\r\nMuspelheim features in both the creation of the world and its downfall. In the creation narrative given by Snorri, fire from Muspelheim and ice from Niflheim meet in the middle of Ginnungagap and forge the giant Ymir, the first being from whose corpse the world was eventually shaped. During Ragnarok, the fire giant Surt, who should probably be identified with the Múspell of Old Norse poetry, arrives from the south (surely meant to be understood as the realm of heat and fire) with a flaming sword to slay the gods and burn the world.[3][4] For the Vikings, then, the cosmos both begins and ends in fire (along with ice)."
    },
    {
        "id": "24",
        "title": "Alfheim",
        "date": "Forever",
        "description": "Alfheim (pronounced “ALF-hame;” Old Norse Álfheimr, “The Homeland of the Elves”) is, as the name suggests, the world inhabited by the elves, a class of demigod-like beings in the pre-Christian mythology and religion of the Norse and other Germanic peoples.\r\n\r\nAlfheim is never described in the sources that form the basis of our current knowledge of heathen Germanic religion, but is rather merely mentioned in passing in a few places. However, the elves are described as being luminous and “more beautiful than the sun,”[1] so we may suppose that their homeland was a gracious realm of light and beauty. Although the realms that comprise the Nine Worlds of the Norse cosmology are never listed, it seems highly probable that, given the prominence of the elves in Germanic religion, Alfheim was one of them.\r\n\r\nThe Vanir god Freyr is said to be the ruler of Alfheim.[2] Scholars have long puzzled over what to make of this, and no wholly satisfactory conclusions have been put forth. The relationship between the elves and the Vanir is highly ambiguous and involves considerable overlap between the two groups.[3] Freyr’s position as lord of Alfheim, therefore, while hard to interpret with much precision, shouldn’t be entirely surprising."
    },
    {
        "id": "25",
        "title": "Nidavellir or Svartalfheim",
        "date": "Forever",
        "description": "In Old Norse literature, the home of the dwarves is called either Nidavellir (pronounced “NID-uh-vell-ir;” Old Norse Niðavellir, “Low Fields” or “Dark Fields”) or Svartalfheim (pronounced “SVART-alf-hame;” Old Norse Svartálfaheimr, “Homeland of the Black Elves”).\r\n\r\nThe dwarves are master smiths and craftsmen who live beneath the ground. Accordingly, Nidavellir or Svartalfheim was probably thought of as a labyrinthine, subterranean complex of mines and forges.\r\n\r\nIf either of these names is the “original” one – the name that the Vikings used to refer to the dwarves’ homeland – it’s probably Nidavellir. While both names occur only in relatively late and problematic sources, the first source to use the term “Nidavellir” (the poem Völuspá, “The Prophecy of the Seeress”) is older than the first (and only) source to use the term “Svartalfheim” (Snorri Sturluson’s Prose Edda).\r\n\r\nThe Völuspá has this (and only this) to say about Nidavellir:\r\n\r\nThere stood in the north\r\nIn Nidavellir\r\nThe golden hall\r\nOf Sindri’s family.[1]\r\n\r\nThe directions “north” and “downward” were commonly associated with each other in Old Norse literature, and master craftsmen renowned for their work with precious metals would naturally build exquisite halls for themselves, so this description is probably based on authentic material from the Viking Age. (Sindri is a dwarf mentioned elsewhere in Old Norse literature.)\r\n\r\nSnorri’s descriptions of Svartalfheim, however, are much more confused. For one thing, he – and only he – calls the dwarves “black elves” (svartálfar or døkkálfar).[2] While the boundaries between the different kinds of demigod-like beings were quite blurry in the Viking Age, Snorri’s terminology just introduces an additional and unnecessary layer of complication. The name “Svartalfheim” is an extension of his invented terminology.\r\n\r\nApparently based on a misunderstanding of the stanza in Völuspá, Snorri says that “Sindri” is the name of the dwarves’ hall. Snorri also includes Sindri and Nidavellir in his Christian-influenced descriptions of the Norse afterlife and the apocalypse, adding yet another layer of unnecessary confusion.[3] This serves as a reminder that Snorri and his Prose Edda can’t be taken at face value as providing reliable information about Viking Age beliefs and practices.\r\n\r\nUnfortunately, then, we know only the vaguest outlines of what the Vikings thought the homeland of the dwarves was like."
    },
    {
        "id": "26",
        "title": "Hel",
        "date": "Forever",
        "description": "Hel (Old Norse Hel, “Hidden;”[1] pronounced like the English word “Hell”) is the most general name for the underworld where many of the dead dwell. It’s presided over by a fearsome goddess whose name is also Hel. Occasionally, it’s also referred to as “Helheim,” “The Realm of Hel,” although this is much more common in the secondary literature than in the Old Norse primary sources.\r\n\r\nLike physical graves, Hel was thought to be located underground. Some sources also place it in the north, the direction which is cold and dark like the grave.[2] A dog is sometimes said to guard its entrance, much like Cerberus in Greek mythology.[3]\r\n\r\nWhat Kind of Place Was Hel?\r\n\r\nThe names of Hel and Hell, the Christian realm of eternal suffering ruled over by Satan, come from the same root in the Proto-Germanic language, which is an ancestor of both Old Norse and, by way of Old English, modern English. That common root has been reconstructed by modern scholars as *haljo, “concealed place,” and words stemming from *haljo seem to have been used to denote the underworld in virtually all Germanic languages. We modern English speakers call the Christian concept of a land of damnation “Hell” because the concept was called hel or helle in Old English.[4] Presumably, hel/helle originally referred to the same kind of Germanic pagan underworld as the Norse Hel, and Christian missionaries to the Anglo-Saxons used the closest word they could find in Old English to refer to Satan’s realm.\r\n\r\nBut apart from the fact that Hel and Hell are both realms of the dead located beneath the ground, the two concepts have nothing in common. While the Old Norse sources are far from clear on exactly how one ended up in one of the Norse afterlife realms rather than another (there were several), what is clear is that where one goes after death isn’t any kind of reward for moral behavior or pious belief, or punishment for immoral behavior or impious belief. (See the article on Death and the Afterlife for more on this point.)\r\n\r\nFurthermore, while the underworld isn’t described often in the sources, when it is, it’s generally cast in neutral or even positive terms. As a place where the dead live on in some capacity, it’s sometimes portrayed as a land of startlingly abundant life on the other side of death.[5] The dead in Hel spend their time doing the same kinds of things that Viking Age men and women did: eating, drinking, fighting, sleeping, and so forth. It wasn’t a place of eternal bliss or torment as much as it was simply a continuation of life somewhere else.\r\n\r\nOf all of the Old Norse sources, only one describes Hel as a thoroughly unpleasant place: the Prose Edda of the thirteenth-century Icelandic scholar Snorri Sturluson. Snorri wrote many generations after Norse paganism had given way to Christianity and ceased to be a living tradition, and he had a habit of stretching the evidence available to him to present his pre-Christian ancestors as having anticipated aspects of Christianity.[6] His downright comically over-the-top portrayal of Hel is an excellent example of this tendency of his. For Snorri, the plate of the goddess Hel is called Hunger (Hungr), her servants Slow (Ganglati) and Lazy (Ganglöt), the threshold of her door Stumbling Block (Fallandaforað), her bed Illness (Kör), and her curtains Bleak Misfortune (Blíkjandabölr).[7] Few scholars accept such descriptions as being authentic products of the Viking Age.[8]\r\n\r\nSimilarly laughable is Snorri’s assertion that those who die in battle go to Valhalla, the sublime hall of the god Odin, while those who die of sickness or old age go to Hel. Snorri himself blatantly contradicts his distinction between Valhalla and Hel in his version of the tale of the death of Baldur, Odin’s son, who is killed violently and is nevertheless borne to Hel.[9] No other source makes this distinction, and several offer further examples to the contrary.\r\n\r\nThe Road to Hel\r\n\r\nThe Old Norse sources describe in uncharacteristic detail the course that one has to travel in order to reach Hel. It even has a name that comes up repeatedly in Old Norse literature: Helvegr, “The Road/Way to Hel.”[10] Given how closely the accounts of this course correspond to the narratives of traditional shamanic journeys of other circumpolar peoples,[11] they seem to recount, and possibly provide templates for, the journeys of Norse shamans. Throughout the Old Norse sources, we find instances of such journeys to Hel undertaken by gods or humans in order to recover a dead spirit or obtain knowledge from the dead.\r\n\r\nA journey by the hero Hadding from the Gesta Danorum (History of the Danes) by the medieval Danish historian Saxo Grammaticus is typical. Here is Old Norse scholar E.O.G. Turville-Petre’s apt summary:\r\n\r\nWhile he was living with Ragnhild, Hadding had another mysterious experience. A woman appeared bearing some herbs. Wishing to know where such herbs grew in winter, Hadding went with this woman under the earth. They passed through mists, and then through sunny, fertile regions, where the herbs had grown. Then they came to a raging torrent, flowing with weapons. Crossing by a bridge, they came upon armies of fallen warriors, locked in eternal battle. As they pressed forward, a wall stood in their way; they could go no further, but the woman tore off the head of a cock, which she happened to have with her, and flung it over the wall. Immediately the cock came to life and crowed.[12]\r\n\r\nThe chicken being thrown over the wall of the underworld (variously called Helgrindr, “The Fence of Hel,” Nágrindr, “Corpse-Fence,” or Valgrindr, “The Fence of the Fallen”[13]) is especially intriguing. I have yet to see a convincing explanation as to its meaning, but it seems to correspond to a Norse funeral custom. The Arab traveler Ibn Fadlan recorded a scene he witnessed where a Norse chief had died and a woman was about to be killed to accompany him, and she cut off a hen’s head and threw it into the ship where her dead body would soon follow.[14]\r\n\r\nAnother typical account is the journey of Hermod to Hel to attempt to retrieve Baldur, who had been killed by Loki. While the account comes exclusively from Snorri, it matches the other pieces of this genre of underworld-journey narratives closely enough, both in its overall form and in small details, that we can be sure that Snorri relied on an older source or sources now lost to us. The relevant part of the story goes like this:\r\n\r\nThe god Hermod departed from Asgard, the celestial stronghold of the gods, on Sleipnir, the horse of Odin. He descended down the trunk of Yggdrasil, the great tree that forms the central axis of the cosmos. For nine nights, he rode through deep valleys, so pitch-black he could not see the way. Finally, he came to a river, Gjöll (“Loud Noise”[15]), which was spanned by a bridge named Gjallarbrú (“Bridge over Gjöll”[16]). On the bridge stood a giantess, Móðguðr (“Furious Battle”[17]). The guardian of the bridge wanted to know why Hermod wanted to cross, since she could tell from his appearance that he was not yet dead. His answer, that he was going to look after Baldur, was evidently satisfactory to the giantess, who let him cross, telling him that Hel lay downwards and northwards (niðr ok norðr) from the bridge. When Hermod arrived at the fence around Hel, he jumped over it rather than going through the gate. He then made his way toward the hall of Hel (the goddess), where he found Baldur sitting in the seat of honor.[18]\r\n\r\nThe common elements in Snorri’s and Saxo’s accounts seem to be the following: Hel was located underground – down and to the north, the realm of cold and general lifelessness. It was reached by descending from a higher point with the help of a guide – an unnamed (dead) woman in Hadding’s case, and Sleipnir in the Prose Edda and the poem Baldrs Draumar (Baldur’s Dreams) in the Poetic Edda. After traveling through darkness and mist, the traveler would come to a river, perhaps a torrential river of water, but more commonly a river of clanging weapons.[19] There was a bridge over the river that one had to cross. After a time, one would finally arrive at the wall surrounding Hel. The dead presumably entered through the main gate, but those living beings who, for whatever reasons, undertook the journey to Hel seem to have thought it either impossible or unwise to enter through the gate. So they either found sneakier ways to cross into Hel or turned back."
    }
]